Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = Новый Структура;
	ПредставлениеОтчета=ЭтотОбъект.Метаданные().Представление();
	МассивНазначений = Новый Массив;
	ПараметрыРегистрации.Вставить("Вид", 				"ДополнительныйОтчет"); //возможны варианты - ЗаполнениеОбъекта, ДополнительныйОтчет, СозданиеСвязанныхОбъектов, 
	ПараметрыРегистрации.Вставить("Назначение", 		МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", 		ПредставлениеОтчета); //имя под kt обработка зарегистрирована будет в справочнике внешних обработок
	ПараметрыРегистрации.Вставить("Версия", 			"1.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", 	Истина);
	ПараметрыРегистрации.Вставить("Информация", 		ПредставлениеОтчета);

	//команды
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", 		Новый ОписаниеТипов("Строка")); //как будет выглядеть описание печ.формы для пользователя
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", 		Новый ОписаниеТипов("Строка")); //имя нашего макета
	ТаблицаКоманд.Колонки.Добавить("Использование", 		Новый ОписаниеТипов("Строка")); //ВызовСерверногоМетода
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", 	Новый ОписаниеТипов("Булево")); //Истина
	ТаблицаКоманд.Колонки.Добавить("Модификатор", 			Новый ОписаниеТипов("Строка")); //ПечатьМХL

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление 			= ПредставлениеОтчета;
	НоваяКоманда.Идентификатор 			= ЭтотОбъект.Метаданные().ПолноеИмя(); 
	НоваяКоманда.Использование 			= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение 	= Истина;
	НоваяКоманда.Модификатор 			= ПредставлениеОтчета;

	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);

	Возврат ПараметрыРегистрации;

КонецФункции
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ЭтотОбъект.СхемаКомпоновкиДанных=?(ЭтоПолныеПраваИлиАрхангелськ(),ПолучитьМакет("СКД_Архангельск"),ПолучитьМакет("Основная_СКД"));	
КонецПроцедуры
Функция   ЭтоПолныеПраваИлиАрхангелськ()
	УстановитьПривилегированныйРежим(Истина);
	ОтветДа=   ПараметрыСеанса.ИБ_МассивОСП.Количество()=0 ИЛИ  ЭтоАрхангельск();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ОтветДа;	
КонецФункции
Функция   ЭтоАрхангельск()
	Попытка
		Возврат ПараметрыСеанса.ИБ_МассивОСП.Найти(Справочники.ПодразделенияОрганизаций.НайтиПоКоду("000З-0111"))<>Неопределено;
	Исключение	
		Возврат Ложь;	
	КонецПопытки;	
КонецФункции


