
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
   ЗапрещаемыйОбъект="БДР";
	ЗаполнитьСписок();
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписок()
	Запрос=Новый Запрос;
	Запрос.Текст=ТекстЗапросаЗаполнитьСписок();
	запрос.УстановитьПараметр("ЗапрещаемыйОбъект", ЗапрещаемыйОбъект);
	ТаблицаОСП.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры
&НаСервереБезКонтекста
Функция   ТекстЗапросаЗаполнитьСписок()
	ТекстЗапроса="ВЫБРАТЬ
	             |	ПодразделенияОрганизаций.Ссылка КАК КорневойОСП
	             |ПОМЕСТИТЬ КорневыеОСП
	             |ИЗ
	             |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	             |ГДЕ
	             |	ПодразделенияОрганизаций.Родитель = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.Пустаяссылка)
	             |	И НЕ ПодразделенияОрганизаций.ПометкаУдаления
	             |	И ПодразделенияОрганизаций.Наименование <> """"
	             |	И НЕ ПодразделенияОрганизаций.Код = ""0Б-000001""
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	КорневыеОСП.КорневойОСП КАК ОСП,
	             |	ЕСТЬNULL(ИБ_ДатыЗапретаИзменений.ДатаЗапрета, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗапрета,
	             |	ЕСТЬNULL(ИБ_ДатыЗапретаИзменений.ДатаЗапрета, ДАТАВРЕМЯ(1, 1, 1)) КАК СтараяДатаЗапрета
	             |ИЗ
	             |	КорневыеОСП КАК КорневыеОСП
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИБ_ДатыЗапретаИзменений КАК ИБ_ДатыЗапретаИзменений
	             |		ПО КорневыеОСП.КорневойОСП = ИБ_ДатыЗапретаИзменений.ОСП
	             |			И (ИБ_ДатыЗапретаИзменений.ЗапрещаемыйОбъект = &ЗапрещаемыйОбъект)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	КорневыеОСП.КорневойОСП.Наименование";
	Возврат ТекстЗапроса	
КонецФункции

&НаКлиенте
Процедура УстановитьДатуЗапретаИзменений(Команда)
	 ПоказатьВводДаты(Новый ОписаниеОповещения("УстановитьЕдинуюДляВсехДатуЗапрета",ЭтотОбъект),КонецМесяца(НачалоМесяца(ТекущаяДата())-100),,ЧастиДаты.Дата);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьЕдинуюДляВсехДатуЗапрета(ВыбраннаяДата,ДополнительныеПараметры) Экспорт 
	Если ВыбраннаяДата=Неопределено Тогда
		Возврат; КонецЕсли;
	Для Каждого СтрокаТЧ  ИЗ ТаблицаОСП Цикл
		         СтрокаТЧ.ДатаЗапрета=ВыбраннаяДата;
		КонецЦикла;
	    УстановитьДатуЗапретаПоОСП(ВыбраннаяДата);
	КонецПроцедуры
	&НаСервере
	Процедура УстановитьДатуЗапретаПоОСП(ЕдинаяДата=Неопределено)
		 Редактор=  Пользователи.ТекущийПользователь();
		Для Каждого СтрокаТЧ ИЗ ТаблицаОСП Цикл
			 НоваяДата=?(ЕдинаяДата=Неопределено, СтрокаТЧ.ДатаЗапрета,ЕдинаяДата);
			 Если НоваяДата=СтрокаТЧ.СтараяДатаЗапрета Тогда
				 Продолжить; КонецЕсли;
			
			        ЗаписатьДанныеВРегистр(СтрокаТЧ.ОСП,НоваяДата,Редактор);
				КонецЦикла;
				Сообщить("Операция по установке дат запрета изменений завершена");
		КонецПроцедуры
		&НаСервере
		Процедура ЗаписатьДанныеВРегистр(ОСП,ДатаЗапрета,Редактор)
			НЗ=РегистрыСведений.ИБ_ДатыЗапретаИзменений.СоздатьНаборЗаписей();
			НЗ.Отбор.ЗапрещаемыйОбъект.Установить(ЗапрещаемыйОбъект);
			НЗ.Отбор.ОСП.Установить(ОСП);
			НЗ.Записать();
			ЗаписьНЗ=НЗ.Добавить();
			ЗаписьНЗ.ЗапрещаемыйОбъект=ЗапрещаемыйОбъект;
			ЗаписьНЗ.ОСП=ОСП;
			ЗаписьНЗ.ДатаЗапрета=ДатаЗапрета;
			ЗаписьНЗ.УстановилДатуЗапрета=Редактор;
			Попытка
				НЗ.Записать();
			Исключение
				Сообщить("Не удалось установить дату запрета: "+ОписаниеОшибки());
			КонецПопытки;
		КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОСПДатаЗапретаПриИзменении(Элемент)
			ТД=Элементы.ТаблицаОСП.ТекущиеДанные;
			 ЗаписатьДанныеВРегистр(ТД.ОСП,ТД.ДатаЗапрета,ПользователиКлиентСервер.ТекущийПользователь());
КонецПроцедуры
